In [ ]:
import pandas as pd

### Loading the Dataset

In [ ]:
df=pd.read_csv("DataPreprocessing.csv")

In [ ]:
df

   Region   Age   Income Online Shopper
0   India  49.0  86400.0             No
1  Brazil  32.0  57600.0            Yes
2     USA  35.0  64800.0             No
3  Brazil  43.0  73200.0             No
4     USA  45.0      NaN            Yes
5   India  40.0  69600.0            Yes
6  Brazil   NaN  62400.0             No
7   India  53.0  94800.0            Yes
8     USA  55.0  99600.0             No
9   India  42.0  80400.0            Yes

### View Dataset

In [ ]:
df.head()

   Region   Age   Income Online Shopper
0   India  49.0  86400.0             No
1  Brazil  32.0  57600.0            Yes
2     USA  35.0  64800.0             No
3  Brazil  43.0  73200.0             No
4     USA  45.0      NaN            Yes

In [ ]:
df.tail()

   Region   Age   Income Online Shopper
5   India  40.0  69600.0            Yes
6  Brazil   NaN  62400.0             No
7   India  53.0  94800.0            Yes
8     USA  55.0  99600.0             No
9   India  42.0  80400.0            Yes

### Finding Missing Values

In [ ]:
df.isna().any().any()

True

In [ ]:
df.head(5)

   Region   Age   Income Online Shopper
0   India  49.0  86400.0             No
1  Brazil  32.0  57600.0            Yes
2     USA  35.0  64800.0             No
3  Brazil  43.0  73200.0             No
4     USA  45.0      NaN            Yes

In [ ]:
df.tail(5)

   Region   Age   Income Online Shopper
5   India  40.0  69600.0            Yes
6  Brazil   NaN  62400.0             No
7   India  53.0  94800.0            Yes
8     USA  55.0  99600.0             No
9   India  42.0  80400.0            Yes

### Finding no. of missing values

In [ ]:
df.isna().sum().sum()

2

### Finding realtive missing values in dataset

In [ ]:
df.isna().sum()/len(df)*100

Region             0.0
Age               10.0
Income            10.0
Online Shopper     0.0
dtype: float64

### Determine columns with missings values

In [ ]:
df.loc[:, df.isnull().any()].columns

Index(['Age', 'Income'], dtype='object')

### Determine rows with missings values

In [ ]:
df.dropna()

   Region   Age   Income Online Shopper
0   India  49.0  86400.0             No
1  Brazil  32.0  57600.0            Yes
2     USA  35.0  64800.0             No
3  Brazil  43.0  73200.0             No
5   India  40.0  69600.0            Yes
7   India  53.0  94800.0            Yes
8     USA  55.0  99600.0             No
9   India  42.0  80400.0            Yes

### Fill missing Values

In [ ]:
df['Age'].fillna(40, inplace=True)

In [ ]:
df

   Region   Age   Income Online Shopper
0   India  49.0  86400.0             No
1  Brazil  32.0  57600.0            Yes
2     USA  35.0  64800.0             No
3  Brazil  43.0  73200.0             No
4     USA  45.0      NaN            Yes
5   India  40.0  69600.0            Yes
6  Brazil  40.0  62400.0             No
7   India  53.0  94800.0            Yes
8     USA  55.0  99600.0             No
9   India  42.0  80400.0            Yes

### fill missing values with mean

In [ ]:
mean=df['Income'].mean()

In [ ]:
mean

76533.33333333333

In [ ]:
df['Income'].fillna(mean,inplace=True)

In [ ]:
df

   Region   Age        Income Online Shopper
0   India  49.0  86400.000000             No
1  Brazil  32.0  57600.000000            Yes
2     USA  35.0  64800.000000             No
3  Brazil  43.0  73200.000000             No
4     USA  45.0  76533.333333            Yes
5   India  40.0  69600.000000            Yes
6  Brazil  40.0  62400.000000             No
7   India  53.0  94800.000000            Yes
8     USA  55.0  99600.000000             No
9   India  42.0  80400.000000            Yes

In [ ]:
df['Online Shopper'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: Online Shopper, dtype: bool

In [ ]:
df['Online Shopper'].fillna('unknown',inplace=True)

In [ ]:
df

   Region   Age        Income Online Shopper
0   India  49.0  86400.000000             No
1  Brazil  32.0  57600.000000            Yes
2     USA  35.0  64800.000000             No
3  Brazil  43.0  73200.000000             No
4     USA  45.0  76533.333333            Yes
5   India  40.0  69600.000000            Yes
6  Brazil  40.0  62400.000000             No
7   India  53.0  94800.000000            Yes
8     USA  55.0  99600.000000             No
9   India  42.0  80400.000000            Yes